
&НаСервере
Процедура СотрудникПриИзмененииНаСервере()
	УстановитьВидимостьПроцента();
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	СотрудникПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВидимостьПроцента();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПроцента()
	ВидимостьПроцента = Истина;
	КатегорияСотрудника = ВКМ_ДополнительныеРеквизиты.ЗначениеРеквизитаКатегорияУПользователя(Запись.Сотрудник);
	Если Не КатегорияСотрудника = Неопределено  Тогда
		ВидимостьПроцента = (КатегорияСотрудника = Перечисления.ВКМ_КатегорияСотрудников.Специалист);
	КонецЕсли;
	Элементы.ПроцентОтРабот.Видимость = ВидимостьПроцента;
КонецПроцедуры
