#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВидимостьПроцента();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	СотрудникПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СотрудникПриИзмененииНаСервере()
	УстановитьВидимостьПроцента();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПроцента()
	ВидимостьПроцента = Истина;
	КатегорияСотрудника = ВКМ_ДополнительныеРеквизитыВызовСервера.ЗначениеРеквизитаКатегорияУПользователя(Запись.Сотрудник);
	Если Не КатегорияСотрудника = Неопределено  Тогда
		ВидимостьПроцента = (КатегорияСотрудника = Перечисления.ВКМ_КатегорияСотрудников.Специалист);
	КонецЕсли;
	Элементы.ПроцентОтРабот.Видимость = ВидимостьПроцента;
КонецПроцедуры

#КонецОбласти


