
//Отправить сообщение пользователю
Процедура ВКМ_ОтправитьСообщениеВГруппу(Текст) Экспорт
	СтруктураНастроек = ВКМ_ПолучитьНастройкиTelegram();
	
	СтруктураДляОтправки = Новый Структура;
	СтруктураДляОтправки.Вставить("chat_id", СтруктураНастроек.chat_id);
	СтруктураДляОтправки.Вставить("text", Текст);
	HTTPСоединение  =  Новый HTTPСоединение(СтруктураНастроек.api,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	Приемник = "bot" + СтруктураНастроек.token + "/sendMessage";
	HTTPЗапрос = Новый HTTPЗапрос(Приемник);
	HTTPЗапрос.Заголовки.Вставить("Content-type", "application/json");
	HTTPЗапрос.УстановитьТелоИзСтроки(ЗаписатьЗначениеJSON(СтруктураДляОтправки));
	
	Ответ = HTTPСоединение.Получить(HTTPЗапрос);
	
	Если Ответ.КодСостояния <> 200 Тогда 
		
		
		СтруктураСобытий = Новый Структура("ИмяСобытия, ПредставлениеУровня, Комментарий,ДатаСобытия");
		
		СтруктураСобытий.ИмяСобытия 		 = "Ошибка отправки данных в телеграм";
		
		СтруктураСобытий.ПредставлениеУровня = "Ошибка";	//"Информация", "Ошибка", "Предупреждение", "Примечание".
		СтруктураСобытий.Комментарий 		 = СтрШаблон("Ошибка проверки, код стостояния: %1, тело ответа: %2",
				Ответ.КодСостояния, Ответ.ПолучитьТелоКакСтроку());
		СтруктураСобытий.ДатаСобытия 		 = ТекущаяДатаСеанса();
		
		СобытияДляЖурналаРегистрации = Новый СписокЗначений();
		СобытияДляЖурналаРегистрации.Добавить(СтруктураСобытий);
		
		ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СобытияДляЖурналаРегистрации);
		
		ТекстСообщения = СтрШаблон("Ошибка отправки данных в телеграм");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВКМ_ОбработатьУведомленияПоЗаявкам() Экспорт
	Справочники.ВКМ_УведомленияТелеграмБотуДляОтправки.ВКМ_ОбработатьУведомленияПоЗаявкам();
КонецПроцедуры

#Область ОбщиеКоманды 
//Получим настройки подключения
Функция ВКМ_ПолучитьНастройкиTelegram() Экспорт
	
	token = Константы.ВКМ_ТокенТГБот.Получить();
	
	Если Не ЗначениеЗаполнено(token) Тогда
		ТекстСообщения = СтрШаблон("Не заполнено значение константы токен ТГ бота");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Неопределено;
	КонецЕсли;
	
	chat_id = Константы.ВКМ_ИдентификаторГруппыТГ.Получить();
	
	Если Не ЗначениеЗаполнено(chat_id) Тогда
		ТекстСообщения = СтрШаблон("Не заполнено значение идентификатора группы ТГ бота");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Неопределено;
	КонецЕсли;
		
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("chat_id",chat_id);
	СтруктураНастроек.Вставить("token",token);
	СтруктураНастроек.Вставить("api","api.telegram.org");
	
	Возврат СтруктураНастроек;
КонецФункции // ПолучитьПараметры()
#КонецОбласти

