#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
    Документы.РеализацияТоваровУслуг.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
   // Документы.ОплатаОтПокупателя.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецФункции

#КонецОбласти

Функция СоздатьДокументИзКалендаря(ДанныеКалендаря) Экспорт
	
	НовыйДокумент = СоздатьДокумент();
	НовыйДокумент.Дата = ТекущаяДатаСеанса();
	ЗаполнитьЗначенияСвойств(НовыйДокумент, ДанныеКалендаря);
	
	Если Не НовыйДокумент.ПроверитьЗаполнение() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	Исключение
		НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;
	
	Возврат НовыйДокумент.Ссылка;
	
КонецФункции

#КонецЕсли