#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс


// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
    Документы.РеализацияТоваровУслуг.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоздатьДокументИзКалендаря(ДанныеКалендаря) Экспорт
	
	НовыйДокумент = СоздатьДокумент();
	НовыйДокумент.Дата = ТекущаяДатаСеанса();
	ЗаполнитьЗначенияСвойств(НовыйДокумент, ДанныеКалендаря);
	
	Если Не НовыйДокумент.ПроверитьЗаполнение() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	Исключение
		НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;
	
	Возврат НовыйДокумент.Ссылка;
	
КонецФункции

#КонецОбласти

#КонецЕсли