Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаЧасовКОплатеПоДокументу = ВыполненныеРаботы.Итог("ЧасыКОплатеКлиенту");	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ,Режим)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты.Ссылка КАК Ссылка,
		|	ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты.Значение КАК СтоимостьЧаса
		|ПОМЕСТИТЬ ВТ_СтоимостьЧаса
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов.ВКМ_ДополнительныеРеквизиты КАК ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты
		|ГДЕ
		|	ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты.Реквизит = ЗНАЧЕНИЕ(Справочник.ВКМ_ДополнтительныеРеквизиты.СтоимостьЧасаРаботыСпециалиста)
		|	И ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты.Ссылка = &СсылкаДоговор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты.Значение КАК НачалоДоговора,
		|	ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ДатаНачалаДоговора
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов.ВКМ_ДополнительныеРеквизиты КАК ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты
		|ГДЕ
		|	ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты.Реквизит = ЗНАЧЕНИЕ(Справочник.ВКМ_ДополнтительныеРеквизиты.ДатаНачалаДействияДоговора)
		|	И ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты.Ссылка = &СсылкаДоговор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты.Значение КАК ОкончаниеДоговора,
		|	ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ДатаОкончанияДоговора
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов.ВКМ_ДополнительныеРеквизиты КАК ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты
		|ГДЕ
		|	ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты.Реквизит = ЗНАЧЕНИЕ(Справочник.ВКМ_ДополнтительныеРеквизиты.ДатаОкончанияДействияДоговора)
		|	И ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты.Ссылка = &СсылкаДоговор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот
		|ПОМЕСТИТЬ ВТ_ПроцентСотрудника
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период, Сотрудник = &Сотрудник) КАК
		|		ВКМ_УсловияОплатыСотрудниковСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Договор КАК Договор,
		|	ВКМ_ОбслуживаниеКлиента.Договор.Представление КАК ДоговорПредставление,
		|	ВКМ_ОбслуживаниеКлиента.Клиент КАК Клиент,
		|	ВКМ_ОбслуживаниеКлиента.СуммаЧасовКОплатеПоДокументу КАК КоличествоЧасов,
		|	ВКМ_ОбслуживаниеКлиента.Дата КАК Период,
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВидДоговора КАК ВидДоговора,
		|	ВТ_ДатаНачалаДоговора.НачалоДоговора КАК НачалоДоговора,
		|	ВТ_ДатаОкончанияДоговора.ОкончаниеДоговора КАК ОкончаниеДоговора,
		|	ЕСТЬNULL(ВТ_СтоимостьЧаса.СтоимостьЧаса, 0) КАК СтоимостьЧаса,
		|	ВТ_ПроцентСотрудника.ПроцентОтРабот КАК ПроцентОтРабот,
		|	ВТ_ПроцентСотрудника.Сотрудник КАК Сотрудник
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатаНачалаДоговора КАК ВТ_ДатаНачалаДоговора
		|		ПО ВКМ_ОбслуживаниеКлиента.Договор.Ссылка = ВТ_ДатаНачалаДоговора.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатаОкончанияДоговора КАК ВТ_ДатаОкончанияДоговора
		|		ПО ВКМ_ОбслуживаниеКлиента.Договор.Ссылка = ВТ_ДатаОкончанияДоговора.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтоимостьЧаса КАК ВТ_СтоимостьЧаса
		|		ПО ВКМ_ОбслуживаниеКлиента.Договор.Ссылка = ВТ_СтоимостьЧаса.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПроцентСотрудника КАК ВТ_ПроцентСотрудника
		|		ПО ВКМ_ОбслуживаниеКлиента.Специалист = ВТ_ПроцентСотрудника.Сотрудник
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("СсылкаДоговор", Договор);
	Запрос.УстановитьПараметр("Сотрудник", Специалист);
	Запрос.УстановитьПараметр("Период", МоментВремени());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда		
		ПроверитьДанныеДокумента(ВыборкаДетальныеЗаписи,Отказ);
		ПроверитьНаличиеПроцентаПоСотруднику(ВыборкаДетальныеЗаписи,Отказ);
		Если Не Отказ Тогда
			// регистр ВКМ_ВыполненныеКлиентуРаботы
			Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
			ЗаполнитьЗначенияСвойств(Движение,ВыборкаДетальныеЗаписи);
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.СуммаКОплате = Движение.КоличествоЧасов * ВыборкаДетальныеЗаписи.СтоимостьЧаса;
			// регистр ВКМ_ВыполненныеСотрудникомРаботы
			Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
			Движение.Период = Дата;
			Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
			Движение.ЧасовКОплате = ВыборкаДетальныеЗаписи.КоличествоЧасов;
			Движение.СуммаКОплате = Движение.ЧасовКОплате * ВыборкаДетальныеЗаписи.СтоимостьЧаса * ВыборкаДетальныеЗаписи.ПроцентОтРабот / 100;
		КонецЕсли;
	КонецЕсли;
	
	
//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПроверитьДанныеДокумента(ВыборкаДетальныеЗаписи,Отказ)
	Если Не ВыборкаДетальныеЗаписи.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
			ТекстСообщения = СтрШаблон("Договор %1 имеет вид отличный от Абонентское обслуживание. Выберите договор с корректным видом.",ВыборкаДетальныеЗаписи.ДоговорПредставление);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.СтоимостьЧаса = 0 Тогда
			ТекстСообщения = СтрШаблон("По договору %1 не установлена стоимость часа работы специалиста.",ВыборкаДетальныеЗаписи.ДоговорПредставление);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.НачалоДоговора) Тогда
			ТекстСообщения = СтрШаблон("По договору %1 не установлена дата начала действия договора.",ВыборкаДетальныеЗаписи.ДоговорПредставление);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ОкончаниеДоговора) Тогда
			ТекстСообщения = СтрШаблон("По договору %1 не установлена дата окончания действия договора.",ВыборкаДетальныеЗаписи.ДоговорПредставление);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		ДатаДокументаВДиапазоне = (Дата >= ВыборкаДетальныеЗаписи.НачалоДоговора И Дата <= КонецДня(ВыборкаДетальныеЗаписи.ОкончаниеДоговора));
		
		Если Не ДатаДокументаВДиапазоне Тогда
			ТекстСообщения = СтрШаблон("Дата документа %1 находится вне диапазона действия договора %2 с %3 по %4.",
				Формат(Дата,"ДФ=dd.MM.yyyy;"),
				ВыборкаДетальныеЗаписи.ДоговорПредставление,
				Формат(ВыборкаДетальныеЗаписи.НачалоДоговора,"ДФ=dd.MM.yyyy;"),
				Формат(ВыборкаДетальныеЗаписи.ОкончаниеДоговора,"ДФ=dd.MM.yyyy;"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
КонецПроцедуры

Процедура ПроверитьНаличиеПроцентаПоСотруднику(ВыборкаДетальныеЗаписи,Отказ)
	Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПроцентОтРабот) Тогда
			ТекстСообщения = СтрШаблон("У сотрудника %1 не установлен процент на %2 Операция отменена",ВыборкаДетальныеЗаписи.Сотрудник, Формат(Дата,"ДЛФ=DD;"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Отказ = Истина;
			Возврат;
		КонецЕсли;		
КонецПроцедуры







