
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
	КонецЕсли;
	
	//{{Стрельцов Д.А.: Создание документа на основании документа Обслуживание клиента
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВКМ_ОбслуживаниеКлиента") Тогда
		ВКМ_ЗаполнитьНаОснованииОбслуживаниеКлиента(ДанныеЗаполнения);
	КонецЕсли;
	//}}
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателя.Организация КАК Организация,
	               |	ЗаказПокупателя.Контрагент КАК Контрагент,
	               |	ЗаказПокупателя.Договор КАК Договор,
	               |	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	               |	ЗаказПокупателя.Товары.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Товары,
	               |	ЗаказПокупателя.Услуги.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Услуги
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	ЗаказПокупателя.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	ТоварыОснования = Выборка.Товары.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), ТоварыОснования);
	КонецЦикла;
	
	УслугиОснования = Выборка.Услуги.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Услуги.Добавить(), УслугиОснования);
	КонецЦикла;
	
	Основание = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОбработкаЗаказов.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Движение = Движения.ОбработкаЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Заказ = Основание;
	Движение.СуммаОтгрузки = СуммаДокумента;

	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

КонецПроцедуры

Процедура ВКМ_ЗаполнитьНаОснованииОбслуживаниеКлиента(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ОбслуживаниеКлиента.Договор КАК Договор,
	|	ВКМ_ОбслуживаниеКлиента.Клиент КАК Контрагент,
	|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Ответственный,
	|	ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ОписаниеРабот КАК Номенклатура,
	|		ФактическиПотраченоЧасов КАК ФактическиПотраченоЧасов,
	|		ЧасыКОплатеКлиенту КАК Количество) КАК ВыполненныеРаботы,
	|	ЕСТЬNULL(ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты.Значение, 0) КАК Цена
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.ВКМ_ДополнительныеРеквизиты КАК
	|			ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты
	|		ПО ВКМ_ОбслуживаниеКлиента.Договор.Ссылка = ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты.Ссылка
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка
	|	И
	|		ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты.Реквизит = ЗНАЧЕНИЕ(Справочник.ВКМ_ДополнтительныеРеквизиты.СтоимостьЧасаРаботыСпециалиста)";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	Цена = Выборка.Цена;
	
	УслугиОснования = Выборка.ВыполненныеРаботы.Выбрать();
	Пока УслугиОснования.Следующий() Цикл
		Строка = Услуги.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, УслугиОснования);
		Строка.Цена = Цена;
	КонецЦикла;
	
	Основание = ДанныеЗаполнения;
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли

Процедура ВКМ_ВыполнитьАвтозаполнение() Экспорт
	
	НоменклатураАбонентскаяПлата = Неопределено;
	НоменклатураРаботыСпециалиста = Неопределено;
	УстановленыЗначенияКонстант = ПроверитьУстановкуЗначенийКонстант(НоменклатураАбонентскаяПлата,НоменклатураРаботыСпециалиста);
	Если Не УстановленыЗначенияКонстант Тогда
		ВызватьИсключение НСтр("ru='Не установлены константы!'");
	КонецЕсли;
	
	Услуги.Очистить();
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты.Значение, 0) КАК АбонентскаяПлата,
		|	ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты.Ссылка КАК Договор
		|ПОМЕСТИТЬ ВТ_АбонентскаяПлата
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов.ВКМ_ДополнительныеРеквизиты КАК ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты
		|ГДЕ
		|	ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты.Реквизит = ЗНАЧЕНИЕ(Справочник.ВКМ_ДополнтительныеРеквизиты.ЕжемесячнаяАбонентскаяПлата)
		|	И ДоговорыКонтрагентовВКМ_ДополнительныеРеквизиты.Ссылка = &ДоговорСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор КАК Договор,
		|	СУММА(ВКМ_ВыполненныеКлиентуРаботыОбороты.КоличествоЧасовОборот) КАК Количество,
		|	СУММА(ВКМ_ВыполненныеКлиентуРаботыОбороты.СуммаКОплатеОборот) КАК Сумма
		|ПОМЕСТИТЬ ВТ_ВыполненыеРаботы
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(&НачалоПериода, &КонецПериода,,
		|		Договор.Ссылка = &ДоговорСсылка) КАК ВКМ_ВыполненныеКлиентуРаботыОбороты
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВТ_АбонентскаяПлата.Договор, ВТ_ВыполненыеРаботы.Договор) КАК Договор,
		|	ЕСТЬNULL(ВТ_АбонентскаяПлата.АбонентскаяПлата, 0) КАК АбонентскаяПлата,
		|	ЕСТЬNULL(ВТ_ВыполненыеРаботы.Количество, 0) КАК Количество,
		|	ЕСТЬNULL(ВТ_ВыполненыеРаботы.Сумма, 0) КАК Сумма
		|ИЗ
		|	ВТ_АбонентскаяПлата КАК ВТ_АбонентскаяПлата
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ВыполненыеРаботы КАК ВТ_ВыполненыеРаботы
		|		ПО ВТ_ВыполненыеРаботы.Договор = ВТ_АбонентскаяПлата.Договор";
	
	Запрос.УстановитьПараметр("ДоговорСсылка", Договор);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Если ВыборкаДетальныеЗаписи.АбонентскаяПлата <> 0 Тогда
			СтрокаУслуги = Услуги.Добавить();
			СтрокаУслуги.Номенклатура = НоменклатураАбонентскаяПлата;
			СтрокаУслуги.Количество = 1;
			СтрокаУслуги.Цена = ВыборкаДетальныеЗаписи.АбонентскаяПлата;
			СтрокаУслуги.Сумма = СтрокаУслуги.Количество * СтрокаУслуги.Цена;
		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.Количество <> 0 Тогда
			СтрокаУслуги = Услуги.Добавить();
			СтрокаУслуги.Номенклатура = НоменклатураРаботыСпециалиста;
			СтрокаУслуги.Количество = ВыборкаДетальныеЗаписи.Количество;
			СтрокаУслуги.Сумма = ВыборкаДетальныеЗаписи.Сумма;
			СтрокаУслуги.Цена = СтрокаУслуги.Сумма/СтрокаУслуги.Количество;
		КонецЕсли;	
	КонецЕсли;;

КонецПроцедуры

Функция ПроверитьУстановкуЗначенийКонстант(НоменклатураАбонентскаяПлата,НоменклатураРаботыСпециалиста)
	
	Результат = Истина;
	НоменклатураАбонентскаяПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
	Если Не ЗначениеЗаполнено(НоменклатураАбонентскаяПлата) Тогда
		//ТекстСообщения = СтрШаблон("Не установлена номенклатура абонентская плата. Операция отменена");
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Результат = Ложь;
	КонецЕсли;
	
	НоменклатураРаботыСпециалиста = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
	Если Не ЗначениеЗаполнено(НоменклатураРаботыСпециалиста) Тогда
		//ТекстСообщения = СтрШаблон("Не установлена номенклатура абонентская плата. Операция отменена");
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
