

Функция ВКМ_СоздатьЭлементСправочникаСУведомлениямиТелеграмБоту(ДанныеДляЭлементаСправочника) Экспорт
	ТекстСообщения = ВКМ_ПодготовитьТекстУведомления(ДанныеДляЭлементаСправочника);
	НовоеУведомление = Справочники.ВКМ_УведомленияТелеграмБотуДляОтправки.СоздатьЭлемент();
	НовоеУведомление.ТекстСообщения = ТекстСообщения;
	НовоеУведомление.Записать();
	Возврат НовоеУведомление.Ссылка;
КонецФункции

Функция ВКМ_ПодготовитьТекстУведомления(ДанныеДляЭлементаСправочника);
	Текст = ДанныеДляЭлементаСправочника.Преамбула;
	Если ЗначениеЗаполнено(ДанныеДляЭлементаСправочника.Специалист) Тогда
		Текст = Текст + " Специалист " + ДанныеДляЭлементаСправочника.Специалист;
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеДляЭлементаСправочника.Клиент) Тогда
		Текст = Текст + " Клиент " + ДанныеДляЭлементаСправочника.Клиент;
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеДляЭлементаСправочника.ДатаПроведенияРабот) Тогда
		Текст = Текст + " Дата работ " + Формат(ДанныеДляЭлементаСправочника.ДатаПроведенияРабот,"ДФ=dd.MM.yyyy;");
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеДляЭлементаСправочника.ВремяНачалаРаботПлан) Тогда
		Текст = Текст + " Время начала " +  Формат(ДанныеДляЭлементаСправочника.ВремяНачалаРаботПлан,"ДЛФ=T;"); 
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеДляЭлементаСправочника.ВремяОкончанияРаботПлан) Тогда
		Текст = Текст + " Время окончания " +  Формат(ДанныеДляЭлементаСправочника.ВремяОкончанияРаботПлан,"ДЛФ=T;"); 
	КонецЕсли;
	
	Возврат Текст;

КонецФункции

Процедура ВКМ_ОбработатьУведомленияПоЗаявкам() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_УведомленияТелеграмБотуДляОтправки.Ссылка КАК Ссылка,
		|	ВКМ_УведомленияТелеграмБотуДляОтправки.ТекстСообщения КАК ТекстСообщения
		|ИЗ
		|	Справочник.ВКМ_УведомленияТелеграмБотуДляОтправки КАК ВКМ_УведомленияТелеграмБотуДляОтправки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВКМ_ТелеграмСервер.ВКМ_ОтправитьСообщениеВГруппу(ВыборкаДетальныеЗаписи.ТекстСообщения);
		ЭлементОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
    	ЭлементОбъект.Удалить();
	КонецЦикла;
	
	
КонецПроцедуры