#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ВКМ_СоздатьАктыНаСервере()Экспорт 
	
	ТекСтрока = 0;
	ВсегоСтрок = РеализацииПоДоговорам.Количество();
	Для Каждого СтрокаТЧ Из РеализацииПоДоговорам Цикл
		ТекСтрока = ТекСтрока + 1;
		
		ПроцентВыполнения = (ТекСтрока/ВсегоСтрок)*100;
		ПроцентВыполнения = Окр(ПроцентВыполнения,0);
		
		ДлительныеОперации.СообщитьПрогресс(ПроцентВыполнения,СокрЛП(СтрокаТЧ.Договор));
		Если ЗначениеЗаполнено(СтрокаТЧ.Реализация) Тогда
			Продолжить;
		КонецЕсли;
		Документы.РеализацияТоваровУслуг.ВКМ_СоздатьДокументРеализации(СтрокаТЧ.Договор,Период);
	КонецЦикла;
		
КонецПроцедуры

#КонецЕсли