
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	АдресВХранилище = Параметры.АдресВХранилище;

    Если Не ЗначениеЗаполнено(АдресВХранилище) Тогда
        Возврат;
    КонецЕсли;

    Попытка
        ТЗИсточник = ПолучитьИзВременногоХранилища(АдресВХранилище);
    Исключение
        ТекстСообщения = СтрШаблон("Ошибка получения данных из временного хранилища: %1",ОписаниеОшибки());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
        Возврат;
    КонецПопытки;

    Если ТипЗнч(ТЗИсточник) <> Тип("ТаблицаЗначений") Тогда
        ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данные из временного хранилища не являются таблицей значений.");
        Возврат;
    КонецЕсли;

    // Проверяем наличие обязательных колонок в исходной ТЗ
    Если ТЗИсточник.Колонки.Найти("Сотрудник") = Неопределено
        ИЛИ ТЗИсточник.Колонки.Найти("ДатаНачала") = Неопределено
        ИЛИ ТЗИсточник.Колонки.Найти("ДатаОкончания") = Неопределено Тогда
        
        ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В таблице значений отсутствуют обязательные колонки: Сотрудник, ДатаНачала, ДатаОкончания.");
        Возврат;
    КонецЕсли;
	
	ГрафикОтпусков.Очистить();
    
    Серия = ГрафикОтпусков.УстановитьСерию("Отпуск");
	
	Для Каждого Строка Из ТЗИсточник Цикл
		
		Точка = ГрафикОтпусков.УстановитьТочку(Строка.Сотрудник);
		
		Значение = ГрафикОтпусков.ПолучитьЗначение(Точка, Серия);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;
		
	КонецЦикла;

      
КонецПроцедуры
