#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьПланировщикНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ДокументОбслуживаниеКлиентаЗаписан" Тогда
		Объект.Планировщик.Элементы.Очистить();
		ЗаполнитьПланировщикНаСервере();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПланировщикПередСозданием(Элемент, Начало, Конец, ЗначенияИзмерений, Текст, СтандартнаяОбработка)
	Если НачалоДня(Конец)>НачалоДня(Начало) Тогда
		Конец = НачалоДня(Начало) + 18 * 60 * 60;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПриОкончанииРедактирования(Элемент, НовыйЭлемент, ОтменаРедактирования)
	
	Если ОтменаРедактирования Тогда
        Возврат;
    КонецЕсли;
	
	ДанныеДляДокументов = Новый Массив;
    Для Каждого ТекущийЭлементПланировщика Из Элемент.ВыделенныеЭлементы Цикл
        СтрокаМассива = СтруктураСтроки();
        СтрокаМассива.Специалист = ТекущийЭлементПланировщика.ЗначенияИзмерений["Специалисты"];
        СтрокаМассива.ДатаПроведенияРабот = НачалоДня(ТекущийЭлементПланировщика.Начало);
        СтрокаМассива.ВремяНачалаРаботПлан = Время(ТекущийЭлементПланировщика.Начало);
        СтрокаМассива.ВремяОкончанияРаботПлан = Время(ТекущийЭлементПланировщика.Конец);
        СтрокаМассива.ОписаниеПроблемы = ТекущийЭлементПланировщика.Текст;
		ДанныеДляДокументов.Добавить(СтрокаМассива);
    КонецЦикла;
	
	ПланировщикПриОкончанииРедактированияНаСервере(ДанныеДляДокументов);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПланировщикПриОкончанииРедактированияНаСервере(ДанныеДляДокументов)
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	РеквизитОбъект.СоздатьДокументыОбслуживаниеКлиентов(ДанныеДляДокументов);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПланировщикНаСервере()
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	РеквизитОбъект.ЗаполнитьПланировщик();

КонецПроцедуры

&НаКлиенте
Функция СтруктураСтроки()
	
	Результат = Новый Структура;
	Результат.Вставить("Специалист","");
	Результат.Вставить("ДатаПроведенияРабот","");
	Результат.Вставить("ВремяНачалаРаботПлан","");
	Результат.Вставить("ВремяОкончанияРаботПлан","");
	Результат.Вставить("ОписаниеПроблемы","");
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Время(ДатаСоВременем)
	Результат = Дата(1, 1, 1, Час(ДатаСоВременем), Минута(ДатаСоВременем), Секунда(ДатаСоВременем));	
	Возврат Результат;	
КонецФункции

#КонецОбласти
