Процедура ЗаполнитьПланировщик() Экспорт
	
	ВыборкаСпециалист = ДанныеИзДокументовОбслуживаниеКлиента();

	ЗаполнитьПланировщикДанными(ВыборкаСпециалист);

	ВыполнитьНастройкуПланировщика();

КонецПроцедуры 

Функция ДанныеИзДокументовОбслуживаниеКлиента()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист,
		|	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
		|	ВКМ_ОбслуживаниеКлиента.ВремяНачалаРаботПлан КАК ВремяНачалаРаботПлан,
		|	ВКМ_ОбслуживаниеКлиента.ВремяОкончанияРаботПлан КАК ВремяОкончанияРаботПлан,
		|	ВКМ_ОбслуживаниеКлиента.Ссылка КАК ДокументСсылка,
		|	ВКМ_ОбслуживаниеКлиента.Представление КАК Представление
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ИТОГИ
		|ПО
		|	Специалист";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСпециалист = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Возврат ВыборкаСпециалист;
	
КонецФункции

Процедура ЗаполнитьПланировщикДанными(ВыборкаСпециалист)
	
	Планировщик.ТекущиеПериодыОтображения.Очистить();
    Планировщик.ТекущиеПериодыОтображения.Добавить(НачалоНедели(ТекущаяДатаСеанса()), КонецНедели(ТекущаяДатаСеанса()));
	ИзмеренияПланировщика = Планировщик.Измерения;
	ИзмеренияПланировщика.Очистить();
	
	ИзмерениеСпециалисты  = ИзмеренияПланировщика.Добавить("Специалисты");

	ЭлементыПланировщика = Планировщик.Элементы;
    ЭлементыПланировщика.Очистить();
	
	Пока ВыборкаСпециалист.Следующий() Цикл
		НовыйСпециалист = ИзмерениеСпециалисты.Элементы.Добавить(ВыборкаСпециалист.Специалист);
        НовыйСпециалист.Текст = ВыборкаСпециалист.Специалист.Наименование;

		ВыборкаДетальныеЗаписи = ВыборкаСпециалист.Выбрать();
		СоответствиеЗначений = Новый Соответствие;
       	СоответствиеЗначений.Вставить("Специалисты",   ВыборкаСпециалист.Специалист);
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ВремяНачалоВСекундах = ВыборкаДетальныеЗаписи.ВремяНачалаРаботПлан;
			СекундыНачало = 60 * 60 * Час(ВремяНачалоВСекундах) + 60 * Минута(ВремяНачалоВСекундах) + Секунда(ВремяНачалоВСекундах);
        	Начало  = ВыборкаДетальныеЗаписи.ДатаПроведенияРабот + СекундыНачало;
        	ВремяКонцаВСекундах = ВыборкаДетальныеЗаписи.ВремяОкончанияРаботПлан;
			СекундыКонец = 60 * 60 * Час(ВремяКонцаВСекундах) + 60 * Минута(ВремяКонцаВСекундах) + Секунда(ВремяКонцаВСекундах);
        	Конец   = ВыборкаДетальныеЗаписи.ДатаПроведенияРабот + СекундыКонец;
        	НовыйЭлемент = ЭлементыПланировщика.Добавить(Начало, Конец);
        	НовыйЭлемент.ЗначенияИзмерений  = Новый ФиксированноеСоответствие(СоответствиеЗначений);
        	НовыйЭлемент.Текст = ВыборкаДетальныеЗаписи.Представление;
        	НовыйЭлемент.Значение = ВыборкаДетальныеЗаписи.ДокументСсылка;

		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Процедура ВыполнитьНастройкуПланировщика()
	
	Планировщик.ЕдиницаПериодическогоВарианта = ТипЕдиницыШкалыВремени.Час;
	Планировщик.КратностьПериодическогоВарианта = 24;
	Планировщик.ОтступСНачалаПереносаШкалыВремени = 8;
	Планировщик.ОтступСКонцаПереносаШкалыВремени = 5;
	Планировщик.ВыравниватьГраницыЭлементовПоШкалеВремени = Ложь;
	Планировщик.ФорматПеренесенныхЗаголовковШкалыВремени = "ДФ='дддд, д ММММ гггг'";
	
КонецПроцедуры

Процедура СоздатьДокументыОбслуживаниеКлиентов(ДанныеДляДокументов) Экспорт
	
	ДокОбслуживаниеСсылка = Документы.ВКМ_ОбслуживаниеКлиента.СоздатьДокументИзКалендаря(ДанныеДляДокументов[0]);
	Если ДокОбслуживаниеСсылка = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ обслуживание клиента не создан");
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = СтрШаблон("Создан документ %1",ДокОбслуживаниеСсылка);
	ЗаполнитьПланировщик();
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры