#Область СлужебныеПроцедурыИФункции

Функция ЗначениеРеквизитаКатегорияУПользователя(ПользовательСсылка) Экспорт
	
	Результат = Неопределено;
	КатегорияРеквизитИмя = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя",
		"КатегорияСпециалиста");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПользователиДополнительныеРеквизиты.Свойство КАК Свойство,
	|	ПользователиДополнительныеРеквизиты.Значение КАК Значение
	|ИЗ
	|	Справочник.Пользователи.ДополнительныеРеквизиты КАК ПользователиДополнительныеРеквизиты
	|ГДЕ
	|	ПользователиДополнительныеРеквизиты.Свойство = &Свойство
	|	И ПользователиДополнительныеРеквизиты.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", ПользовательСсылка);
	Запрос.УстановитьПараметр("Свойство", КатегорияРеквизитИмя);
	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Результат = ВыборкаДетальныеЗаписи.Значение;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
